var result = 'number'+3+3 //number 33 
// стрічка перетворює цифри до стрічкі і далі плюс просто канкатенує їх між собою
console.log(result)

var result1 = 3 // 3
//null це посто поржне значення тому з 3 воно ніяк не додається
console.log(result1)

var result3 = 5 && "qwerty" // qwerty
//два значення дорівнює true і повертається останне обчисленне значення тобто qwerty
console.log(result3)

var result4 = +'40'+ +'2' + "hillel" // 42hillel
//унарний плюс завжди призводить до чісла, 
// виходить що стрічка 40 і 2 стаюсь числами потім між собою додаються 40 + 2 = 42 
// і далі канкатенуємо стрічку hillel, JS автоматично приводить всі числа у виразі до рядкових значень та виконeє конкатенацію
//якщо будь-яка з частин виразу є рядком
console.log(result4)

var result5 = '10' - 5 === 6; // false
//тут стрічка 10 перетворюється на число 10, потім віднимається від числа 5. 
// При строгому порівняні результат буде false, томущо 5 не дорінює 6.
console.log(result5)

var result6 = true + false // 1
// JS пробує завжди привести все до числа. true це 1 false 0.
// при додавані 1 + 0 результат 1.
console.log(result6)

var result7 = '4px' - 3 // NaN
//JS пробує перетворити стрічку '4px' до числа але залишається px 
// і виходить що неможливо провести корректну арефметичну операцію число 4px - 3 Nan не дорівнює нічому
console.log(result7)

var result8 = '4' - 3 // 1
//Перетворення стрічки '4' у чісло і далі звичайна арефметична операція.
console.log(result8)

var result9 = '6' + 3 ** 0; // 61
// Спочатку виконується піднесення числа 3 до ступення 0 результат 1 
// тому-що при піднесені до степеня 0 будь-якого ненульового числа результатом буде 1
//далі стрічка 6 конкатенує 1, JS автоматично приводить всі числа у виразі до рядкових значень та виконує конкатенацію
//якщо будь-яка з частин виразу є рядком
console.log(result9)

var result10 = 12 / '6' // 2
// Звичайна арефметична операція томущо JS призводить все до числа.
console.log(result10)

var result11 = '10' + (5 === 6) //10false
// Спочатку виконується строге порівняня 5 та 6 воно повертає false далі JS просто конкатенує false разом зі стрічкою '10'
console.log(result11)

var result12 = null == '' // false
// == Порівнює два значення на рівність, null - це порожність а '' - це стрічка
console.log(result12)

var result13 = 3 ** (9 / 3); // 27
// Спочатку виконується дія у дужках результат ділення 3
// потім 3 підноситься до ступіня 3.
console.log(result13)

var result14 = !!'false' == !!'true' // true
// Стрічки false та true перетворються на boolean значення
// і при їх порівняні == відбувається порівняння по рівності знвчення
console.log(result14)

var result15 = 0 || '0' && 1 // 1
// || перша умова у нас повертає true і тому ми йдемо далі
// && у нас зліва і з права - true тому ми пройшли повністю вираз і повернули останне значення.
console.log(result15)

var result16 = (+null == false) < 1 // false
// Спочатку виконується вираз у дужках і унарний + перетворює null на число 0
// Далі порівнюється 0 та false виходить true і це цифра 1
// потім порівнюється 1 менше 1 false
console.log(result16)

var result17 = false && true || true // true
// && повертає false, тому що обидва операнди повинні бути true
// далі порівнюється false та true і тут повертається true якщо хоч один операнд true
console.log(result17)

var result18 = false && (false || true) //false
// Спочатку виконується вираз у дужках і він повернає true
// після цього порівнюється false та true, повертається false тому-що обидва операнди повінні бути true
console.log(result18)

var result19 = (+null == false) < 1 ** 5 // false
// Спочатку виконується вираз що в дужках і він повертає 1 тому-що при порівняні значень повертається true
// Далі відбувається піднесення 1 до ступення 5 результат піднесення 1
// Далі порівнюється 1 з дужок та 1 яка була піднесенна до ступення 5 
// 1 не менше 1 тому повертає false 
console.log(result19)